/* Строгий режим */
'use strict';
/* переменная хранящяя название */
const name = 'Генератор защитного поля';
/* Вывод в консоль */
console.log('Название:', name);
/* переменная хранящяя цену товара */
let price = 1000;
/* Вывод в консоль */
console.log('Цена:', price);
/* шаблонная строка выведения в консоль информации о товаре */
console.log(`Выбран «${name}», цена за штуку ${price} кредитов.`);
/* Преопределение переменной */
price = 2000;
/* Вывод в консоль */
console.log('Новая цена:', price);
/* шаблонная строка выведения в консоль информации о товаре */
console.log(`Выбран «${name}», цена за штуку ${price} кредитов.`);
