/* Строгий режим */
'use strict';
/* Константа хранящяя пароль */
const ADMIN_PASSWORD = 'jqueryismyjam';
/* Ввод польователем пароля */
const userPasword = prompt(
  `Введите пароль для авторизации администратора в панели управления:`,
);
/* Обьявление переменной */
let message;
/* Проверка на отмену пользователем */
if (userPasword === null) {
  message = 'Отменено пользователем!';
} else {
  /* тернарный оператор: проверка пароля */
  userPasword === ADMIN_PASSWORD
    ? (message = 'Добро пожаловать!')
    : (message = 'Доступ запрещен - неверный пароль!');
}
/* Вывод окна предупреждения с сообщением */
alert(message);
